### list concat

In [1]:
import numpy as np
import pandas as pd
s1 = pd.Series([0,1], index=['a', 'b'])
display(s1)
s2 = pd.Series([2,3,4], index=['c', 'd', 'e'])
display(s2)
s3 = pd.Series([5,6], index=['f', 'g'])
display(s3)

a    0
b    1
dtype: int64

c    2
d    3
e    4
dtype: int64

f    5
g    6
dtype: int64

In [2]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [3]:
pd.concat([s1, s2, s3], axis = 1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

### dataframe concat

In [4]:
df1 = pd.DataFrame(np.arange(6).reshape(3,2),
                   index = ['a', 'b', 'c'],
                   columns = ['one', 'two'])
display(df1)
df2 = pd.DataFrame(np.arange(4).reshape(2,2),
                   index = ['a', 'c'],
                   columns = ['three', 'four'])
display(df2)

   one  two
a    0    1
b    2    3
c    4    5

   three  four
a      0     1
c      2     3

In [5]:
pd.concat([df1, df2])

   one  two  three  four
a  0.0  1.0    NaN   NaN
b  2.0  3.0    NaN   NaN
c  4.0  5.0    NaN   NaN
a  NaN  NaN    0.0   1.0
c  NaN  NaN    2.0   3.0

In [6]:
pd.concat([df1, df2], axis = 1)

   one  two  three  four
a    0    1    0.0   1.0
b    2    3    NaN   NaN
c    4    5    2.0   3.0

In [7]:
pd.concat([df1, df2], axis = 1, keys=['台北', '台南'])

   台北        台南
  one two three four
a   0   1   0.0  1.0
b   2   3   NaN  NaN
c   4   5   2.0  3.0

In [8]:
df1 = pd.DataFrame(np.random.randn(3,4), columns = ['a', 'b', 'c', 'd'])
display(df1)
df2 = pd.DataFrame(np.random.randn(2,3), columns = ['b', 'd', 'a'])
display(df2)

pd.concat([df1,df2])

          a         b         c         d
0 -0.768516  1.030612 -1.385703 -1.250567
1  1.121225  0.911009 -1.666479 -0.168250
2 -0.460279  0.571569 -1.361036  0.153559

          b         d         a
0  0.612982  0.819674 -1.166823
1 -0.681721 -1.673310  1.603678

          a         b         c         d
0 -0.768516  1.030612 -1.385703 -1.250567
1  1.121225  0.911009 -1.666479 -0.168250
2 -0.460279  0.571569 -1.361036  0.153559
0 -1.166823  0.612982       NaN  0.819674
1  1.603678 -0.681721       NaN -1.673310

In [9]:
pd.concat([df1, df2], ignore_index=True)

          a         b         c         d
0 -0.768516  1.030612 -1.385703 -1.250567
1  1.121225  0.911009 -1.666479 -0.168250
2 -0.460279  0.571569 -1.361036  0.153559
3 -1.166823  0.612982       NaN  0.819674
4  1.603678 -0.681721       NaN -1.673310